trade_exp/src/Documents/ЛистСогласования/ЛистСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЛистСогласования</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="bd7ea247-d70a-4d92-8cd1-47dd38150946">
    <name>ЗадолженностьПоДоговору</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3512a52c-9acd-45aa-804a-ca5be089f33f">
    <name>ЗадолженностьПоПартнеру</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0bc5285-0919-4f85-a76a-917121dc97f7">
    <name>Проблема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89f1256b-558f-47e6-9ac4-50effd1ea3da">
    <name>ДатаИсполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e3352f3-d5d8-490e-bf93-180010c0e2bc">
    <name>Согласовано</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2aa8b804-d300-40d4-8612-ffc4be650575">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4ea323fd-1fd1-401c-8754-d23f642bbee1">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e25d6271-38c5-420f-857c-1046650bddb2">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5eb42b1f-fbbe-48cd-b72e-a17e84f5b3fd">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2969a8aa-a5b3-4ce7-81b3-c196f690ff12">
    <name>Согласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2664f229-27c5-4ab7-bdcc-6e1f12591738">
    <name>Исполнен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79deed0e-4a1e-4e98-abff-d97cca969ea3">
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cd483cea-3167-4be8-9a7b-907195fed864">
    <name>ОплатаДо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a82a6d7e-91c4-476b-846d-35797a773436">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c21d35e3-631d-41e4-97ad-6641158d01f1">
    <name>Согласователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="64f86b4c-7d54-46b4-ac7a-f66b7c8a4ed3">
    <name>ДатаРегистрацииИсполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="61d8cf96-a87b-4b3f-82bd-f47b88a0a6b2">
    <name>ДатаРегистрацииСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e9696be9-259d-48d2-acae-a488245743b7">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7a11fe18-5ed9-4686-81a4-2c953068f858">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0e10f187-eed8-4a74-ad3f-41977c655684">
    <name>ОстатокДоступногоЛимита</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1a49d888-bd7f-4334-8ff8-e93a57cb570a">
    <name>СуммаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="526eac68-cb4b-4908-bc13-1a77e20acbf6">
    <name>Аннулирован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bc47dd80-4fa8-4382-85cc-0bb2a6ea2344">
    <name>ДатаРегистрацииАннулирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eb1f6b46-b63a-41b8-be2a-95d8f14c5069">
    <name>ПользовательАннулировал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="061685f0-091a-457d-9c28-92025f6c5b4f">
    <name>СуммаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0bf38673-8ec2-4f32-8979-463fb5698aa6">
    <name>ДокументыСданы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e0147949-9ac7-484e-a0ca-8b34f672cff8">
    <name>НомерДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="164c893d-909d-49d8-a7ba-800c18b6d039">
    <name>ДатаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f4b22395-72bb-4776-b524-cfb53c57a4f4">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="550c31a7-7fbc-4734-a07f-2c1c7740b581">
    <name>АвторДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="28ad8094-987b-4a04-be24-8dfc5c80007b">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="233e2c0e-f8f8-4b89-8226-26d79824c73b">
    <name>ТелефонВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9d617b0f-530e-468c-9892-04f5cb814fd8">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="67a5e386-695b-4a2d-b797-85e8575cd0d9">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="adf90053-7b0e-4c0c-b68f-dea98e3d5512">
    <name>ЗакрывающийДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b202c1c5-6f08-4c5a-a971-994b3a823381">
    <name>ПричинаАнулирования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f48d72a7-688f-4060-9471-78ce17ef6985">
    <name>ДокументыСданыКомментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="651738b7-f1d8-42b6-8715-ecf95d1cf2e6">
    <name>СогласованиеПросроченнойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e1bc5b57-b12c-4d9d-8031-2f2f4a41c589">
    <name>МАП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4441e03a-af91-4f94-b3af-ef3e1da779c9">
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="311a625c-24d8-4904-b476-ab8a851af32e">
    <name>ДатаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="af9eb79a-5875-48dd-a78f-f6b647d35e28">
    <name>СчетФактура</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="29b69425-b470-40ba-a4e7-ccf20f0881a0">
    <name>ОтправленоСогласователю</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bb028d7b-43a8-477f-9304-ad8ecc5530a4">
    <name>ДатаПередачиВБухгалтерию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1900bbe4-7fbe-47c9-9810-e3bd898afe33">
    <name>СтатусЛистаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ce52be8e-dbd2-4c4b-b7a7-611e5ca5521c">
    <name>ЕстьМаркированныйТовар</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a9084dcf-265d-4098-820d-eccd4153f5d6">
    <name>ОтправленоМенеджеру</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="07c7c64e-3afa-4b32-b3c3-4aca4478e4e0">
    <name>Проблемы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="78b64a6c-b2f2-484c-8326-b668f1343f0e">
      <name>ПроблемаРасшифровка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6bf3592f-8fd6-4297-970c-6377faa8eec4">
      <name>Выполнено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f315772c-11c4-4d38-86f9-344a698693fe">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/ВидыОперацийЛистовСогласования/ВидыОперацийЛистовСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4e174d0c-fcf4-4edb-b771-d537842fb500">
  <name>ВидыОперацийЛистовСогласования</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="0d0f242a-48ae-475d-ad76-05749bd4f77a">
    <name>СогласованиеТранзитов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="462fe71b-3cb9-4c1c-9888-bdb3e6556265">
    <name>СогласованиеЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="37f89f9f-becc-4e83-9791-d21c6238816b">
    <name>СогласованиеОформления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ПорядокРасчетов/ПорядокРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПорядокРасчетов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПоДоговорамКонтрагентов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоЗаказамНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="27ca6d68-e67a-4889-9637-02a127ea6bb7">
    <name>ПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4f954f84-d9f9-4d34-8b96-cd90db36a2c4">
    <name>ПоДоговорамНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ЛистСогласования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать 
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ЛистСогласования";
	КомандаПечати.Идентификатор = "ЛистСогласования";
	КомандаПечати.Представление = НСтр("ru = 'Напечатать лист'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.СразуНаПринтер = Ложь;
	КомандаПечати.Порядок = 1;
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	ТабДок= Новый ТабличныйДокумент;
	Для Каждого Ссылка Из МассивОбъектов Цикл
		Если Ссылка.ОстатокДоступногоЛимита < 0 И Ссылка.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности Тогда 
			Сообщить("Привышен остаток доступного лимита. Печать невозможна!", СтатусСообщения.ОченьВажное);
		Иначе
			СформироватьЛистСогласования(Ссылка, ТабДок);
		КонецЕсли;
	КонецЦикла;
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ЛистСогласования", НСтр("ru = 'Лист согласования'"), ТабДок);
КонецПроцедуры

Процедура  СформироватьЛистСогласования(Ссылка, ТабДок)
	
	Макет= ПолучитьМакет("ЛистСогласования");
	ОбластьШапка= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗадолженность= Макет.ПолучитьОбласть("Задолженность");
	ОбластьПроблема= Макет.ПолучитьОбласть("Проблема");
	ОбластьПодвал= Макет.ПолучитьОбласть("Подвал");
	
	Основание = Ссылка.Основание;
	
	//Шапка
	ОбластьШапка.Параметры.Заполнить(Основание);
	ОбластьШапка.Параметры.Заполнить(Ссылка);
	ОбластьШапка.Параметры.Дата= Формат(Основание.Дата, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(ОбластьШапка);
	//Задолженности
	Если Ссылка.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности Тогда
		ОбластьЗадолженность.Параметры.Заполнить(Ссылка);
		ТабДок.Вывести(ОбластьЗадолженность);
	Иначе
		ОбластьПроблема.Параметры.Заполнить(Ссылка);
		ТабДок.Вывести(ОбластьПроблема);
	КонецЕсли;
	//Подвал
	ОбластьПодвал.Параметры.Заполнить(Ссылка);
	ОбластьПодвал.Параметры.ОсновнойМенеджер = Ссылка.ОсновнойМенеджер;
	
	
	Если ЗначениеЗаполнено(Основание) Тогда
		РеквизитыОснования = Основание.Метаданные().Реквизиты;
		Если РеквизитыОснования.Найти("Автор") <> Неопределено Тогда 
			ОбластьПодвал.Параметры.АвторДокумента = Основание.Автор;
		ИначеЕсли РеквизитыОснования.Найти("Менеджер") <> Неопределено Тогда
			ОбластьПодвал.Параметры.АвторДокумента = Основание.Менеджер;
		КонецЕсли;
	КонецЕсли;
	
	//ОбластьШапка.Параметры.СчФактура = ПродажиВызовСервера.СчетФактураДокумента(Ссылка.Основание, Ссылка.Основание.Организация);
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
КонецПроцедуры
#КонецОбласти 

#Область СозданиеНаОсновании
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
	ИмяДокумента= "ЛистСогласования";
	Если ПравоДоступа("Добавление", Метаданные.Документы[ИмяДокумента]) Тогда
		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы[ИмяДокумента].ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы[ИмяДокумента]);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции
#КонецОбласти 

Процедура ЗаполнитьДанныеПоОснованию(Основание, Объект, ВидОперации = Неопределено) Экспорт

	Если Основание <> Неопределено Тогда
		
		Если типзнч(Основание) = тип("документссылка.КорректировкаЗадолженности") Тогда
			ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления;
		КонецЕсли;
		
		Объект.ВидОперации = ВидОперации;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления Тогда
			Объект.Дата = ТекущаяДата();
		Иначе 
			Объект.Дата = Основание.Дата;
		КонецЕсли;
		
		Объект.Основание = Основание.ссылка;		
		Объект.НомерДокумента = Основание.Номер;
		Объект.ДатаДокумента = Основание.Дата;
		Объект.Организация = Основание.Организация;
		Объект.Контрагент = Основание.Контрагент;
		Объект.Подразделение = Основание.Подразделение;
		
		Если ТипЗнч(Основание) <> Тип("ДокументСсылка.КорректировкаЗадолженности") И ТипЗнч(Основание) <> Тип("ДокументСсылка.ЗаказНаДоставкуКлиенту") 
			И ТипЗнч(Основание) <> Тип("ДокументСсылка.ЧекККМ") Тогда
			Объект.Договор = Основание.Договор;
			Объект.ОплатаДо = ЛистыСогласованияСервер.ПолучитьОплатуДо(Основание);

			Объект.СуммаДокумента = Основание.СуммаДокумента;
		КонецЕсли;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления
			И ТипЗнч(Основание) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
			Объект.ОсновнойМенеджер = Объект.Договор.Менеджер;
		Иначе			
			Если Не ЗначениеЗаполнено(Основание.Контрагент.Партнер.ОсновнойМенеджер) и ТипЗнч(Основание) <> Тип("документссылка.КорректировкаЗадолженности") Тогда	
				Объект.ОсновнойМенеджер = Объект.АвторДокумента;
			Иначе
				Объект.ОсновнойМенеджер = Основание.Контрагент.Партнер.ОсновнойМенеджер;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(Основание) <> Тип("ДокументСсылка.ПриобретениеТоваровУслуг") И ТипЗнч(Основание) <> Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
			Объект.МАП = Основание.Контрагент.Партнер.МАП;
		КонецЕсли;
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаРеализации") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаПриобретения") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияУслугПрочихАктивов") Тогда			
			Объект.АвторДокумента = Основание.Менеджер;
		Иначеесли ТипЗнч(Основание)<>Тип("документссылка.КорректировкаЗадолженности") тогда
			Объект.АвторДокумента = Основание.Автор;
		КонецЕсли;
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Объект.Водитель = Основание.Водитель;
			Объект.ТелефонВодителя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Водитель, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица);
		КонецЕсли;
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			НомераСчетовФактур = "";
			Для Каждого СчетФактураВыд Из Документы.СчетФактураВыданный.СчетаФактурыПоОснованию(Основание) Цикл
				НомераСчетовФактур = НомераСчетовФактур + " " + СчетФактураВыд.Номер;
			КонецЦикла;
			Объект.СчетФактура = СокрЛП(НомераСчетовФактур);
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
			Объект.СчетФактура = СокрЛП(Основание.НомерВходящегоДокумента);
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьЗадолженностьСервер(Объект);
КонецПроцедуры


#Область Экспортные

Процедура ОбновитьЗадолженностьСервер(Объект) Экспорт
	Объект.ЗадолженностьПоПартнеру= 0;
	Объект.ЗадолженностьПоДоговору= 0;
	Объект.ОстатокДоступногоЛимита= 0;
	Объект.СуммаСогласования= 0;
	ПорядокРасчетов= Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
	
	Если типзнч(Объект.Основание)<>тип("документссылка.КорректировкаЗадолженности") И ТипЗнч(Объект.Основание) <> Тип("ДокументСсылка.ЗаказНаДоставкуКлиенту") 
			И ТипЗнч(Объект.Основание)<>Тип("ДокументСсылка.ЧекККМ") Тогда
		Если ЗначениеЗаполнено(Объект.Основание.Договор) Тогда
			ПорядокРасчетов= Объект.Основание.Договор.ПорядокРасчетов;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидОперации <> Перечисления.ВидыОперацийЛистовСогласования.СогласованиеОформления Тогда
		ДопустимаяСуммаЗадолженности= Объект.Основание.Договор.ДопустимаяСуммаЗадолженности;
		ДатаОстатковМоментВремени= Новый МоментВремени(Объект.Основание.Дата, Объект.Основание);
		
		ДатаОстатков= Новый Граница(ДатаОстатковМоментВремени, ВидГраницы.Включая);
		
		ЗадолженностьПоДоговору= ЛистыСогласованияСервер.ПолучитьСуммуВзаиморасчетовПоДоговору(ДатаОстатков, Объект.Основание.Договор);
		Объект.ЗадолженностьПоДоговору= ЗадолженностьПоДоговору- ДопустимаяСуммаЗадолженности;
		
		
		ЗадолженностьПоПартнеру= ЛистыСогласованияСервер.ПолучитьСуммуВзаиморасчетовПоПартнеру(ДатаОстатков, Объект.Основание.Партнер);
		Объект.ЗадолженностьПоПартнеру= ЗадолженностьПоПартнеру;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеЗадолженности Тогда
			Если ЛистыСогласованияСервер.ЕстьНеЗакрытыеЛистыПоДоговору(Объект) Тогда 
				Объект.СуммаСогласования= Объект.СуммаДокумента;
			ИначеЕсли Объект.СогласованиеПросроченнойЗадолженности тогда
				Объект.СуммаСогласования= Объект.СуммаДокумента;
			Иначе
				Если ЗначениеЗаполнено(Объект.Договор) Тогда
					Объект.СуммаСогласования= ?(Объект.ЗадолженностьПоДоговору<0, 0, Объект.ЗадолженностьПоДоговору);
				Иначе
					Объект.СуммаСогласования= ?(Объект.ЗадолженностьПоПартнеру<0, 0, Объект.ЗадолженностьПоПартнеру);
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли  Объект.ВидОперации = Перечисления.ВидыОперацийЛистовСогласования.СогласованиеТранзитов Тогда
			ДатаОстатков= Новый Граница(КонецДня(Объект.Дата), ВидГраницы.Включая);
			Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
				Договор = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(Объект.Основание.Договор);
				CтрукЗадолженность = ЛистыСогласованияСервер.ПолучитьСуммуВзаиморасчетовПоТранзитам(ДатаОстатков,Договор);
				Задолженность = CтрукЗадолженность.СуммаОстаток;
				Объект.ЗадолженностьПоДоговору = Задолженность;
				
				Если Задолженность >= 0 Тогда//Не было оплаты и есть задолженность
					Объект.СуммаСогласования = Объект.СуммаДокумента;
				ИначеЕсли Объект.СуммаДокумента + Задолженность < 0 Тогда//переплата
					Объект.СуммаСогласования = 0;
				Иначе//частичная или полная оплата
					Объект.СуммаСогласования = Объект.СуммаДокумента+Задолженность;
				КонецЕсли;
			Иначе
				Заказ = ОбъектыРасчетовСервер.ОбъектРасчетовИзСсылки(Объект.Основание);
				CтрукЗадолженность = ЛистыСогласованияСервер.ПолучитьСуммуВзаиморасчетовПоТранзитам(ДатаОстатков, Заказ);
				Объект.ЗадолженностьПоПартнеру = CтрукЗадолженность.СуммаОстаток;
				Объект.СуммаСогласования = ?(CтрукЗадолженность.КОплатеОстаток < 0, 0, CтрукЗадолженность.КОплатеОстаток); 
			КонецЕсли;
			//Объект.ЗадолженностьПоПартнеру как правило отрецательная
			//Если Задолженность >= 0 Тогда//Не было оплаты и есть задолженность
			//	Объект.СуммаСогласования = Объект.СуммаДокумента;
			//ИначеЕсли Объект.СуммаДокумента + Задолженность < 0 Тогда//переплата
			//	Объект.СуммаСогласования = 0;
			//Иначе//частичная или полная оплата
			//	Объект.СуммаСогласования = Объект.СуммаДокумента+Задолженность;
			//КонецЕсли;
			//Объект.СуммаСогласования= ?(Объект.ЗадолженностьПоПартнеру<=0, , Объект.СуммаДокумента);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти 


#КонецЕсли
